TexasInstruments/ind-comms-sdk/examples/industrial_comms/iolink_master_demo/am243x-evm/r5fss0-0_freertos/example.syscfg
gpio7.$name          = "CONFIG_IOL_TX7";
gpio7.pinDir         = "OUTPUT";
gpio7.GPIO_n.$assign = "PRG0_PRU0_GPO16";

gpio8.$name          = "CONFIG_IOL_TX8";
gpio8.pinDir         = "OUTPUT";
gpio8.GPIO_n.$assign = "PRG0_PRU0_GPO17";

gpio9.$name          = "CONFIG_IOL_RX1";
gpio9.rx             = true;
gpio9.GPIO_n.$assign = "PRG0_PRU0_GPO0";

gpio10.$name          = "CONFIG_IOL_RX2";
gpio10.rx             = true;
gpio10.GPIO_n.$assign = "PRG0_PRU0_GPO1";

gpio11.$name          = "CONFIG_IOL_RX3";
gpio11.rx             = true;
gpio11.GPIO_n.$assign = "PRG0_PRU0_GPO2";

gpio12.$name          = "CONFIG_IOL_RX4";
gpio12.rx             = true;
gpio12.GPIO_n.$assign = "PRG0_PRU0_GPO3";

gpio13.$name          = "CONFIG_IOL_RX5";
gpio13.rx             = true;
gpio13.GPIO_n.$assign = "PRG0_PRU0_GPO4";

gpio14.$name          = "CONFIG_IOL_RX6";
gpio14.rx             = true;
gpio14.GPIO_n.$assign = "PRG0_PRU0_GPO5";

gpio15.$name          = "CONFIG_IOL_RX7";
gpio15.rx             = true;
gpio15.GPIO_n.$assign = "PRG0_PRU0_GPO6";

gpio16.$name          = "CONFIG_IOL_RX8";
gpio16.rx             = true;
gpio16.GPIO_n.$assign = "PRG0_PRU0_GPO7";

gpio17.$name          = "CONFIG_IOL_TXEN1";
gpio17.pinDir         = "OUTPUT";
gpio17.GPIO_n.$assign = "PRG0_PRU1_GPO6";

gpio18.$name          = "CONFIG_IOL_TXEN2";
gpio18.pinDir         = "OUTPUT";
gpio18.GPIO_n.$assign = "PRG0_PRU1_GPO8";

gpio19.$name          = "CONFIG_IOL_TXEN3";
gpio19.pinDir         = "OUTPUT";
gpio19.GPIO_n.$assign = "PRG0_PRU1_GPO11";

gpio20.$name          = "CONFIG_IOL_TXEN4";
gpio20.pinDir         = "OUTPUT";
gpio20.GPIO_n.$assign = "PRG0_PRU1_GPO12";

gpio21.$name          = "CONFIG_IOL_TXEN5";
gpio21.pinDir         = "OUTPUT";
gpio21.GPIO_n.$assign = "PRG0_PRU1_GPO13";

gpio22.$name          = "CONFIG_IOL_TXEN6";
gpio22.pinDir         = "OUTPUT";
gpio22.GPIO_n.$assign = "PRG0_PRU1_GPO14";

gpio23.$name          = "CONFIG_IOL_TXEN7";
gpio23.pinDir         = "OUTPUT";
gpio23.GPIO_n.$assign = "PRG0_PRU1_GPO15";

gpio24.$name          = "CONFIG_IOL_TXEN8";
gpio24.pinDir         = "OUTPUT";
gpio24.GPIO_n.$assign = "PRG0_PRU1_GPO16";

gpio25.$name          = "CONFIG_IOL_ENL1";
gpio25.pinDir         = "OUTPUT";
gpio25.rx             = true;
gpio25.GPIO_n.$assign = "PRG0_PRU0_GPO18";

gpio26.$name          = "CONFIG_IOL_ENL2";
gpio26.pinDir         = "OUTPUT";
gpio26.GPIO_n.$assign = "PRG0_PRU0_GPO19";

gpio27.$name          = "CONFIG_IOL_ENL3";
gpio27.pinDir         = "OUTPUT";
gpio27.GPIO_n.$assign = "PRG0_PRU1_GPO0";

gpio28.$name          = "CONFIG_IOL_ENL4";
gpio28.pinDir         = "OUTPUT";
gpio28.GPIO_n.$assign = "PRG0_PRU1_GPO1";

gpio29.$name          = "CONFIG_IOL_ENL5";
gpio29.pinDir         = "OUTPUT";
gpio29.GPIO_n.$assign = "PRG0_PRU1_GPO2";

gpio30.$name          = "CONFIG_IOL_ENL6";
gpio30.pinDir         = "OUTPUT";
gpio30.GPIO_n.$assign = "PRG0_PRU1_GPO3";

gpio31.$name          = "CONFIG_IOL_ENL7";
gpio31.pinDir         = "OUTPUT";
gpio31.GPIO_n.$assign = "PRG0_PRU1_GPO4";

gpio32.$name          = "CONFIG_IOL_ENL8";
gpio32.pinDir         = "OUTPUT";
gpio32.GPIO_n.$assign = "PRG0_PRU1_GPO5";

gpio33.$name          = "CONFIG_IOL_FAULTN1";
gpio33.pu_pd          = "pu";
gpio33.rx             = true;
gpio33.GPIO_n.$assign = "GPMC0_AD0";

gpio34.$name          = "CONFIG_IOL_FAULTN2";
gpio34.pu_pd          = "pu";
gpio34.rx             = true;
gpio34.GPIO_n.$assign = "GPMC0_AD1";

gpio35.$name          = "CONFIG_IOL_FAULTN3";
gpio35.pu_pd          = "pu";
gpio35.rx             = true;
gpio35.GPIO_n.$assign = "GPMC0_AD2";

gpio36.$name          = "CONFIG_IOL_FAULTN4";
gpio36.pu_pd          = "pu";
gpio36.rx             = true;
gpio36.GPIO_n.$assign = "GPMC0_AD3";

gpio37.$name          = "CONFIG_IOL_FAULTN5";
gpio37.pu_pd          = "pu";
gpio37.rx             = true;
gpio37.GPIO_n.$assign = "GPMC0_AD4";

gpio38.$name          = "CONFIG_IOL_FAULTN6";
gpio38.pu_pd          = "pu";
gpio38.rx             = true;
gpio38.GPIO_n.$assign = "GPMC0_AD5";

gpio39.$name          = "CONFIG_IOL_FAULTN7";
gpio39.pu_pd          = "pu";
gpio39.rx             = true;
gpio39.GPIO_n.$assign = "GPMC0_AD6";

gpio40.$name          = "CONFIG_IOL_FAULTN8";
gpio40.pu_pd          = "pu";
gpio40.rx             = true;
gpio40.GPIO_n.$assign = "GPMC0_AD7";

led1.peripheralDriver    = i2c1;
led2.peripheralDriver    = i2c1;
i2c1.$name               = "CONFIG_I2C0";
eeprom1.peripheralDriver = i2c1;
i2c1.I2C.$assign         = "I2C1";
i2c1.I2C.SCL.$assign     = "I2C1_SCL";
i2c1.I2C.SDA.$assign     = "I2C1_SDA";
i2c1.I2C_child.$name     = "drivers_i2c_v0_i2c_v0_template1";

mcspi1.$name                       = "CONFIG_MCSPI_IOL";
mcspi1.mode                        = "MULTI_CONTROLLER";
mcspi1.intrEnable                  = "POLLED";
mcspi1.SPI.$assign                 = "SPI1";
mcspi1.SPI.CLK.$assign             = "SPI1_CLK";
mcspi1.SPI.D0.$assign              = "SPI1_D0";
mcspi1.SPI.D1.$assign              = "SPI1_D1";
mcspi1.child.$name                 = "drivers_mcspi_v0_mcspi_v0_template0";
mcspi1.mcspiChannel.create(2);
mcspi1.mcspiChannel[0].$name       = "CONFIG_MCSPI_CH0";
mcspi1.mcspiChannel[0].CSn.$assign = "SPI1_CS0";
mcspi1.mcspiChannel[1].$name       = "CONFIG_MCSPI_CH1";
mcspi1.mcspiChannel[1].CSn.$assign = "SPI1_CS1";

pruicss1.$name                           = "CONFIG_PRU_ICSS0";
pruicss1.AdditionalICSSSettings[0].$name = "CONFIG_PRU_ICSS_IO0";

pruicss2.$name                           = "CONFIG_PRU_ICSS1";
pruicss2.instance                        = "ICSSG1";
pruicss2.AdditionalICSSSettings[0].$name = "CONFIG_PRU_ICSS_IO1";

uart1.$name            = "CONFIG_UART_CONSOLE";
uart1.UART.$assign     = "USART1";
uart1.UART.RXD.$assign = "UART1_RXD";
uart1.UART.TXD.$assign = "UART1_TXD";

uart2.$name                   = "CONFIG_UART_SMI";
uart2.readMode                = "CALLBACK";
uart2.writeMode               = "CALLBACK";
uart2.readCallbackFxn         = "vUartRxCallback";
uart2.writeCallbackFxn        = "vUartTxCallback";
uart2.useMcuDomainPeripherals = true;
uart2.MCU_UART.$assign        = "MCU_USART0";
uart2.MCU_UART.RXD.$assign    = "MCU_UART0_RXD";
uart2.MCU_UART.TXD.$assign    = "MCU_UART0_TXD";

